# IsAttached Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Group..::..IsAttached Property
Group Class See Also
---
Indicates wether or not this group is attached to a parent group.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019.1
# Syntax
C#
---
```text
public bool IsAttached { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsAttached As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsAttached {
	bool get ();
}
```

# See Also
Group Class
Autodesk.Revit.DB Namespace